Repository: Aleksei-Iagur/local-government-desktop-addins
Catalog: ArcGISTemplateSharedFunctions/UserMessages.*.resx
Languages: fa_ir

# ConstructionToolsAsk_1
source: was not found, the point along feature will not be added! \nContinue?
fa_ir: یافت نشد، نقطه در طول عارضه اضافه نخواهد شد! ادامه می دهید؟

# GeoNetToolsMess_11h
source: layer do not meet the connectivity criteria.
fa_ir: لایه فوق قوانین اتصال را رعایت نمی کند

# ConstructionToolsMess_1
source: Layer representing mains was not found. Configuration indicated feature class name:
fa_ir: لایه ی خط لوله یافت نشد. تنظیمات براساس نام کلاس زیر تنظیم شده :

# GeoNetToolsProc_13c
source: Disconnecting the main
fa_ir: قطع ارتباط خط لوله اصلی

# LoadImg
source: loading an image
fa_ir: بارگذاری یک تصویر

# EditCtrl
source: edit control
fa_ir: کنترل ویرایش

# SlctLbl_2
source: Select Config for Attribute Transfer
fa_ir: یک فایل تنظیمات را برای انتقال اطلاعات توصیفی انتخاب کنید

# SltByJctCountMess_1
source: junctions were selected
fa_ir: نودها انتخاب شدند

source: Field
fa_ir: فیلد

# GeoNetToolsProc_16l
source: Setting barriers for final trace
fa_ir: در حال تنظیم موانع برای ردیابی

# GeoNetToolsLbl_13b
source: Deactivating AA
fa_ir: در حال غیرفعال کردن افزونه دستیار اطلاعات توصیفی

# GeoNetToolsDone_11a
source: Delete disconnected
fa_ir: حذف عارضه غیر متصل

# GeoNetToolsLbl_16b
source: Destination
fa_ir: مقصد

# Clck2Pts
source: Please Click Two Points for Tracing
fa_ir: لطفا برای ردیابی روی دو نقطه کلیک کنید

# GeoNetToolsAlias_18
source: To Elevation
fa_ir: به ارتفاع

source: Error on
fa_ir: خطا در

# SetValue
source: (Set This Value First)
fa_ir: (ابتدا این مقدار را وارد کنید)

# GeoNetToolsError_12b
source: is not in map.
fa_ir: در نقشه نیست

# GeoNetToolsProc_16e
source: Setting Operable Valves as Barriers
fa_ir: در حال تنظیم شیرهای عملیاتی بعنوان موانع

# StrtEditing
source: Please Start Editing
fa_ir: لطفا وارد حالت ویرایش شود

# GeoNetToolsTitle_11
source: Connection Checker
fa_ir: کنترل کننده ارتباطات

# MergeSlct_2
source: Merge Upstream and Downstream Elevation Data when present.
fa_ir: ادغام داده های ارتفاعی بالادست و پایین دست در صورت وجود

# NoError
source: No errors found.
fa_ir: هیچ خطایی یافت نشد

# GeoNetToolsAlias_2
source: Line Elevation(Downstream Measures)
fa_ir: (ارتفاع خط (میژر پایین دست

# GeoNetToolsTitle_7
source: Connecting
fa_ir: در حال برقراری اتصال

# GeoNetToolsAlias_16
source: To Measure
fa_ir: به میژر

# GeoNetToolsDone_13a
source: Move Features To New Main
fa_ir: جابجایی عوارض به خط لوله اصلی جدید

# GeoNetToolsError_19c
source: The Downstream elevation field(
fa_ir: فیلد ارتفاع پایین دست (

# GeoNetToolsMess_16a
source: No operable
fa_ir: بدون هیچ مورد عملیاتی

# ConstructionToolsError_9
source: Error trying to store the ID of the pipe on the feature\r\n
fa_ir: خطا در زمان ذخیره شناسه لوله در عارضه

# GeoNetToolsDone_20b
source: Flow Accumulation Complete
fa_ir: انباشتگی جریان پایان یافت

# GeoNetToolsMess_15c
source: feature can be reached from this location.
fa_ir: عارضه از این نقطه قابل دسترس است

# GeometryToolsError_6
source: None of the editable layers with selected features have rotation specified. \nIn Layer properties on the Symbology tab, click Advanced to set the rotation field and type.
fa_ir: هیچ کدام از لایه های قابل ویرایش با عوارض انتخابی دورانشان تنظیم نشده است. در تنظیمات لایه در تب سمبل گذاری، دوران را، تنظیم نمایید

# GeoNetToolsTitle_19a
source: Tracing
fa_ir: در حال ردیابی

# ConstructionToolsError_7
source: A closest line was not found in the specified distance with the provided parameters, skipping
fa_ir: نزدیک ترین خط در فاصله تعیین شده با پارامترهای داده شده یافت نشد، نادیده گرفته شد

# GeoNetToolsError_20c
source: The config does not contain any entries for the accumlation trace
fa_ir: فایل تنظیمات هیچ مقداری برای تحلیل انباشتگی جریان ندارد

# GeometryToolsLbl_1
source: Set Measures
fa_ir: تنظیم میژرها

# TOC_6
source: You must have one higlighted layer in the TOC.
fa_ir: باید یک لایه را در جدول لایه ها انتخاب کنید

# MergeOprt_1
source: Loading Merge Features
fa_ir: در حال بارگذاری عوارض ادغام

# TOC_3
source: The highlighted layer in the TOC must be part of a geometric network.
fa_ir: لایه انتخابی در جدول لایه ها باید بخشی از شبکه هندسی باشد

# TOC_1
source: The highlighted layer in the TOC must be a feature layer.
fa_ir: لایه انتخابی در جدول لایه ها باید یک "لایه عارضه" باشد

# GeometryToolsLbl_8
source: Flip Lines to Match Flow
fa_ir: تنظیم جهت ترسیم خط به جهت جریان

# SltByJctCountLbl_4
source: Selection Options
fa_ir: تنظیمات انتخاب

# SltByJctCountLbl_13
source: User Defined
fa_ir: تعریف شده توسط کاربر

# SltByJctCountLbl_21
source: Select Junction by Edge Count
fa_ir: انتخاب نود با تعداد یال

# MergeOprt_3
source: Merge operation aborted.\r\nMultipart edge geometries are not supported, selected features may form multipart feature.
fa_ir: عملیات ادغام لغو شد یال چند قسمتی پشتیبانی نمی شود. عوارض انتخابی یک عارضه چند قسمتی را تشکیل می دهند

# SubTpChange
source: subtype change
fa_ir: تغییر سابتایپ

# GeometryToolsProc_7
source: Splitting Selected Lines at Location
fa_ir: تکه کردن خطوط انتخابی در نقطه

# GeometryToolsLbl_7
source: Flip Lines
fa_ir: برعکس کردن جهت ترسیم خط

# GeoNetToolsProc_18b
source: Tracing:
fa_ir: ردیابی:

# ForSltedLn
source: for the selected lines.
fa_ir: برای خطوط انتخابی

# ConstructionToolsMess_2
source: Layer representing mains was not a line layer:
fa_ir: لایه خط لوله اصلی یک لایه ی خطی نیست:

# GeoNetToolsProc_13d
source: Moving Features
fa_ir: در حال جابجایی عوارض

source: Page
fa_ir: صفحه

# GeoNetToolsError_17b
source: GN and Trace flags are null
fa_ir: شبکه هندسی و پرچم ها نال هستند

# GeoNetToolsTitle_14a
source: Find Connected Trace
fa_ir: ردیابی یافتن متصلات

# IsNowOperable
source: operable status is now
fa_ir: وضعیت عملیاتی هم اکنون هست:

# FeatNotFound
source: No Features Found
fa_ir: هیچ عارضه ای یافت نشد

# ConstructionToolsAsk_3
source: was found for a point along layer, but the geometry is not a point
fa_ir: برای یک نقطه در طول لایه یافت شد، ولی هندسه نقطه ای نیست

# GeoNetToolsProc_16a
source: Getting Source and Valve Layers
fa_ir: در حال دریافت لایه های شیر و منبع

# SltByJctCountLbl_2
source: Select All
fa_ir: انتخاب همه

# GeoNetToolsError_12c
source: Toggle Operational Status
fa_ir: تاگل وضعیت عملیاتی

# AddInAuthor
source: Esri., Inc.
fa_ir: Asra, Inc

source: Valve from
fa_ir: شیر از

# GeoNetToolsTitle_10
source: Diconnecting
fa_ir: در حال قطع ارتباط

# GeoNetToolsProc_16f
source: Running first trace
fa_ir: اجرای اولین ردیابی

# GeoNetToolsMess_14g
source: No upstream features were found.
fa_ir: هیچ عارضه بالا دستی یافت نشد

source: Load
fa_ir: بار

# GeoNetToolsError_20b
source: Must be editing the workspace containing
fa_ir: محیط کاری باید در حال ویرایش باشد. شامل

# MustBEditg
source: Must be editing.
fa_ir: باید در حالت ویرایش باشید

# GeometryToolsLbl_5
source: Split Lines
fa_ir: تکه کردن خطوط

# GeoNetToolsProc_16p
source: Verifying Results
fa_ir: در حال تایید نتایج

# CurrentOID
source: Currently Processing ObjectID:
fa_ir: در حال پردازش شناسه شیء:

source: Complete
fa_ir: پایان

# GeoNetToolsError_18e
source: layer must be editable.
fa_ir: لایه فوق باید قابل ویرایش باشد

# GeoNetToolsAlias_13
source: Elevation
fa_ir: ارتفاع

# GeometryToolsProc_8
source: Splitting lines at Location
fa_ir: تکه کردن خطوط در نقطه

# GeoNetToolsError_20a
source: feature layer was found, but datasource was not set.
fa_ir: لایه عارضه فوق یافت شد، اما منبع داده تنظیم نشده است

# GeoNetToolsMess_11e
source: has been selected.
fa_ir: انتخاب شده است

# GeometryToolsError_5
source: Has null geometry
fa_ir: هندسه ی نال دارد

# CrtPtsAlongLine
source: Create points along a line
fa_ir: ایجاد نقاط در طول یک خط

# GeoNetToolsMess_16b
source: Add a
fa_ir: اضافه کردن یک

# GeoNetToolsAsk_9a
source: Are you sure you wish to disconnect the selected
fa_ir: آیا مطمئنید می خواهید انتخابی ها را جدا نمایید

# GeoNetToolsAsk_9b
source: features?
fa_ir: عارضه؟

# Measure_1
source: Any selected lines in this layer will have it measures set.
fa_ir: همه خط های انتخابی در این لایه 'میژرشان' تنظیم خواهد شد

# SltByJctCountLbl_15
source: Full Extent
fa_ir: نمای کامل

# ConstructionToolsError_8
source: The Point Along feature class was not found
fa_ir: یک نقطه در طول کلاس عارضه یافت نشد

# GeoNetToolsProc_16q
source: Tracing to get final results
fa_ir: در حال ردیابی برای یافتن نتایج نهایی

source: Source from
fa_ir: منبع از

# GeoNetToolsDone_10
source: Disconnect Selected
fa_ir: قطع اتصال انتخابی

# GeoNetToolsMess_20a
source: Finding Accumulation for
fa_ir: در حال یافتن انباشتگی برای

# AddFlagOrClickReturnStatement
source: Error_The trace locations are found, please add a flag or click a location on the network.
fa_ir: خطا! محل ردیابی یافت شد، لطفا یک پرچم اضافه کنید یا روی یک محل از شبکه کلیک کنید.

# GeoNetToolsError_1c
source: You must recreate your geometric network to use this command on this network.
fa_ir: برای استفاده از این فرمان باید دوباره شبکه ی خود را ایجاد کنید

# GeoNetToolsLbl_2
source: Desktop Tools
fa_ir: ابزارهای دسکتاپ

# GeoNetToolsProc_13a
source: Moving Connections
fa_ir: در حال جابجایی اتصالات

source: assets from the
fa_ir: تجهیزات از

# GeoNetToolsMess_14h
source: Creating Results
fa_ir: ایجاد نتایج

source: No
fa_ir: خیر
