Repository: Aleksei-Iagur/local-government-desktop-addins
Catalog: ArcGISTemplateSharedFunctions/UserMessages.*.resx
Languages: fa_ir

source: Count
fa_ir: تعداد

# NoWaterSourceIdentifiedReturnStatement
source: Error_No Enabled water sources can be identified, make sure a valid water source is feeding this system and its Enabled field is set to true(this is probably the issue)
fa_ir: خطا_هیچ منبع آب فعالی قابل شناسایی نیست، مطمئن شوید یکه سرچشمه معتبر این شبکه را تغذیه می کند و فیلد فعال آن صحیح است.

# GeoNetToolsProc_16j
source: change your configuration file to specify a different feature class as a possible water source.
fa_ir: تغییر در فایل تنظیمات برای تعیین یک کلاسه عارضه متفاوت بعنوان یک منبع محتمل

# AddLine
source: Adding line
fa_ir: در حال اضافه خط

# GeoNetToolsMess_11k
source: layer connects to only one edge. This can be caused by a disconnected pipe or a missing asset. Review the selected
fa_ir: لایه فوق به هیچ یالی متصل نیست. این می تواند بدلیل لوله غیر متصل یا یک تجهیز ناموجود باشد. انتخابی زیر را بررسی کنید

# GeoNetToolsAsk_11b
source: features.
fa_ir: عوارض

# LayerNotFoundReturnStatement
source: Layer no found in newtork
fa_ir: لایه در شبکه یافت نشد

# GeoNetToolsDesc_14c
source: Upstream Trace
fa_ir: ردیابی بالادست

# ConstructionToolsError_5b
source: with in
fa_ir: در محدوده

# GeometryToolsMess_2
source: Building Layer List
fa_ir: در حال ساخت لیست لایه:

# ExportXLError
source: there was an error export to Excel, verify you have 2003 or newer of excel installed
fa_ir: خطایی در خروجی به اکسل رخ داد، مطمئن شوید ورژن 2003 یا جدیدتر نصب شده است

# GeoNetToolsError_11a
source: No geometric networks found.
fa_ir: هیچ شبکه هندسی یافت نشد

# GeoNetToolsDesc_10
source: Diconnecting Assets to the geometric network.
fa_ir: جدا کردن تجهیز از شبکه هندسی.

source: Distance
fa_ir: فاصله

# GeoNetToolsMess_11l
source: layer connect to only one edge. This can be caused by a disconnected pipe or a missing asset. Review the selected
fa_ir: لایه به هیچ یالی متصل نیست. این می تواند بدلیل لوله غیر متصل یا یک تجهیز گم شده باشد. انتخابی را بررسی کنید

# GeoNetToolsMess_11f
source: have been selected.
fa_ir: انتخاب شده اند

# GeoNetToolsMess_15a
source: Setting trace flags
fa_ir: در حال راه اندازی پرچم های ردیابی

# GeometryToolsError_4
source: No features are selected in the highlighed layer.
fa_ir: هیچ عارضه ای در لایه هایلایت شده انتخاب نشده است.

# ConstructionToolsError_1
source: Unable to add lines.
fa_ir: قادر به اضافه کردن خطوط نیست

source: out of
fa_ir: خارج از

# WithOID
source: with an OID of
fa_ir: با شناسه شیء:

# GeometryToolsMess_4b
source: Checking Row
fa_ir: در حال کنترل سطر

# GeoNetToolsMess_14d
source: Running Trace
fa_ir: در حال اجرای ردیابی

# SltByJctCountLbl_1
source: Junction Layers
fa_ir: لایه های نود

source: Refresh
fa_ir: ریفرش

# CrtAssetAndLat
source: Create asset and lateral
fa_ir: ایجاد تجهیز و انشعاب

# GeometryToolsMess_1
source: Setting Rotation Value for Selected Points
fa_ir: در حال تنظیم مقدار دوران نقاط انتخابی

# SltByJctCountProc_1
source: Selecting junctions by edge count
fa_ir: در حال انتخاب نودها بر اساس تعداد یال ها

source: asset from the
fa_ir: تجهیز از

# GeometryToolsProc_5
source: Rotate Selected
fa_ir: چرخاندن انتخابی

# SltByJctCountProc_3
source: Checking feature
fa_ir: در حال کنترل عارضه

# GeoNetToolsMess_20b
source: Flow Accumulation for feature with OID:
fa_ir: انباشتگی جریان برای عارضه با شناسه:

# GeoNetToolsError_19a
source: A location was not found
fa_ir: یک موقعیت یافت نشد

# GeoNetToolsProc_13b
source: Getting Connected Features
fa_ir: در حال دریافت عوارض متصل

# MergeOprt_5
source: merging features
fa_ir: در حال ادغام عوارض

# GeoNetToolsProc_16b
source: Finding first valves
fa_ir: در حال یافتن اولین شیرها

# GeoNetToolsLbl_3
source: Add Flag
fa_ir: اضافه کردن پرچم

# AttrTrasftLoadRError_1
source: A source or target field value is null
fa_ir: مقدار فیلد منبع یا هدف تهی است

# GeoNetToolsAlias_6
source: Top Elevation
fa_ir: بالاترین ارتفاع

source: Error in the
fa_ir: خطا در

# TOC_5
source: Any selected lines in this layer will be merged.
fa_ir: هر خط انتخابی در این لایه ادغام خواهد شد

# TOC_2
source: The highlighted layer in the TOC must contain lines.
fa_ir: لایه انتخابی در جدول لایه ها باید شامل خطوطی باشد

# DontFindFlowEltReturnStatement
source: Error_Error in Finding Flow Elements
fa_ir: خطا_ خطا در یافتن المان های جریان

# GeoNetToolsMess_10a
source: Diconnecting Features from
fa_ir: قطع ارتباط عوارض از

# GeoNetToolsProc_19a
source: Creating Profile Graph
fa_ir: در حال ایجاد نمودار پروفیل

# GeoNetToolsProc_16o
source: feature can be reached from this location other than those that would be isolated by a shutdown.
fa_ir: عارضه این این نقطه قابل دستیابی است بجز آنهایی که با شات دان ، از شبکه ایزوله شدند

source: junctions in the
fa_ir: نودها در

# GeoNetToolsLbl_20a
source: Flow Accumulation Tools
fa_ir: ابزار انباشتگی جریان

# GeoNetToolsMess_11c
source: unneeded junctions in
fa_ir: نودهای غیر ضروری در

source: Error :
fa_ir: خطا:

# GeoNetToolsMess_14e
source: No downstream features were found.
fa_ir: هیچ عارضه پایین دستی یافت نشد

# GeoNetToolsError_12a
source: Operable status cannot be toggled since feature class
fa_ir: وضعیت عملیاتی بودن نمی تواند تغییر کند زیرا کلاس عارضه

# MergeSlct_1
source: Choose the feature with which other features will be merged
fa_ir: عارضه که دیگر عوارض با آن ادغام خواهد شد را انتخاب کنید

# GeometryToolsRealName_1
source: SplitLinesAsClick
fa_ir: تکه کردن خطوط با کلیک

# GeoNetToolsError_19f
source: The ID field(
fa_ir: فیلد شناسه (

# GeoNetToolsAlias_15
source: From Measure
fa_ir: از میژر

# GeoNetToolsError_18c
source: feature class was not found, add it to the map.
fa_ir: کلاس عارضه فوق یافت نشد. آن را به نقشه اضافه نمایید

# GeoNetToolsError_2
source: There are no visible layers that participate in a geometric network.
fa_ir: هیچ لایه ی مرئی که در شبکه شرکت کند یافت نشد

# GeoNetToolsWait_1
source: Establishing flow direction. Please wait....
fa_ir: در حال برقراری جهت جریان. لطفا صبر کنید...

# GeometryToolsError_3
source: The highlighted layer does not support Measures.
fa_ir: لایه ی هایلایت شده 'میژر' را پشتیبانی نمی کند

source: in
fa_ir: در

source: Export asset
fa_ir: خروجی تجهیز

# ZoomOn
source: Zoom on record change
fa_ir: زوم در زمان تغییر رکورد

# GeometryToolsLbl_3
source: Add Rotate
fa_ir: چرخش

# ConstructionToolsError_2
source: Mains and target lines muct be in different feature classes.
fa_ir: خطوط لوله اصلی و خطوط هدف باید در کلاس های متمایز باشند

source: or
fa_ir: یا

# GeoNetToolsError_19e
source: ) was not found for layer:
fa_ir: ) برای لایه زیر یافت نشد:

# ConstructionToolsLbl_6
source: Add Laterals Taps
fa_ir: اضافه کردن شیرهای انشعاب

# SltByJctCountLbl_16
source: Close
fa_ir: بستن

# GeoNetToolsAlias_3
source: Line Elevation(Upstream Measures)
fa_ir: (ارتفاع خط (میژر بالا دست

# GeoNetToolsError_1a
source: Flow direction for
fa_ir: جهت جریان برای

# GeoNetToolsError_8b
source: Nothing To Connect
fa_ir: چیزی برای اتصال وجود ندارد

# SltByJctCountLbl_18
source: Edge Count
fa_ir: تعداد یال

# GeoNetToolsProc_16m
source: Finding directly reachable sources
fa_ir: در حال یافتن منابعی که بطور مستقیم در دسترس اند

# GeometryToolsProc_12
source: Creating Jumps
fa_ir: در حال ایجاد پرش ها

# SlctLbl_1
source: Select a config to load:
fa_ir: یک فایل تنظیمات را برای بارگذاری انتخاب کنید:

# SltByJctCountLbl_20
source: Minimum Edge Count
fa_ir: حداقل تعداد یال

# GeoNetToolsProc_4
source: Finding Network
fa_ir: در حال یافتن شبکه

# GeometryToolsProc_6
source: Rotating point
fa_ir: در حال چرخش نقطه

# ConstructionToolsError_5c
source: units.\r\nThis tool honors a selection set and will only look at selected features, try again after clearing the selected features.
fa_ir: واحد این ابزار به عوارض انتخابی اعمال می شود. بعد از انتخاب مجدد عوارض دوباره تلاش کنید

# ConstructionToolsError_5a
source: A line was not found in
fa_ir: هیچ خطی یافت نشد در

# GeoNetToolsMess_15b
source: No features in the
fa_ir: هیچ عارضه ای وجود ندارد در

# GeoNetToolsProc_16h
source: Tracing to find the source
fa_ir: ردیابی برای یافتن منبع

# FinishSktchPrt
source: Finish Sketch Part
fa_ir: اتمام بخش ترسیم

# GeoNetToolsError_18b
source: features are selected. Please create a selection set and try again.
fa_ir: عارضه انتخاب شده اند. لطفا یک مجموعه انتخاب جدید کنید و سپس دوباره تلاش کنید

# MergeOprt_2
source: Changing Merge Feature
fa_ir: در حال تغییر عارضه ادغام

# GeoNetToolsDesc_14a
source: Find Connected Trace
fa_ir: ردیابی یافتن متصل ها

# ConstrPtsAlongLine
source: Construct points along a line
fa_ir: ساخت نقاط در طول یک خط

# GeoNetToolsAsk_11a
source: With this extent and layer visibility, you will be checking connectivity for
fa_ir: با این محدوده و لایه های قابل رویت، شما اتصالات را کنترل خواهید کرد برای

# GeoNetToolsDesc_18a
source: Progress of the Summary Iso Trace Tool
fa_ir: پیشرفت ابزار خلاصه ردیابی ایزولاسیون

# GeoNetToolsError_17a
source: The geometric network was not found
fa_ir: شبکه هندسی یافت نشد

source: Cancel
fa_ir: لغو

# GeoNetToolsTitle_15a
source: Find Closest
fa_ir: یافتن نزدیک ترین

# GeoNetToolsError_20f
source: No location or layer found, check the location where you clicked or the config file.
fa_ir: هیچ موقعیت یا لایه ای یافت نشد، موقعیتی که کلیک کردید یا فایل تنظیمات را کنترل نمایید

# GeometryToolsLbl_4
source: Split Lines At Location
fa_ir: تکه کردن خطوط در نقطه

# GeometryToolsLbl_6
source: Create Jumps
fa_ir: ایجاد پرش ها

# GeoNetToolsMess_11d
source: have been removed.
fa_ir: حذف شده است

# GeoNetToolsProc_15b
source: Saving connected assets
fa_ir: در حال ذخیره تجهیزات متصل

# ForLn
source: for line
fa_ir: برای خط

source: Scale:
fa_ir: مقیاس:

# GeometryToolsProc_11
source: Splitting line
fa_ir: در حال تکه کردن خط

# GeoNetToolsMess_14f
source: Verify that flow direction has been calculated.
fa_ir: مطمئن شوید جهت جریان محاسبه شده است

# Options
source: Click for options
fa_ir: کلیک برای تنظیمات

# GeoNetToolsAlias_4
source: Point Top Elevation
fa_ir: بالاترین ارتفاع نقطه

# GeoNetToolsTitle_1
source: Geometric Network Tools
fa_ir: ابزار شبکه هندسی

# GeometryToolsMess_4c
source: for Layer:
fa_ir: برای لایه:

# GeoNetToolsError_8a
source: None of the layers with selected features are editable network features.
fa_ir: هیچ کدام از لایه های عوارض انتخابی، عارضه قابل ویرایش شبکه نیستند

# SlctMainFtr
source: Please select a main to merge in the dialog
fa_ir: لطفا یک خط لوله اصلی را برای ادغام انتخاب کنید

# GeometryToolsError_2
source: The highlighted layer datasource is not set.
fa_ir: منبع داده لایه هایلایت شده تنظیم نشده است

# GeoNetToolsAlias_12
source: Measure
fa_ir: میژر

# ConstructionToolsAsk_2
source: was found, but the datasource is not set! \nContinue?
fa_ir: یافت شد، ولی منبع داده تنظیم نشده است! ادامه می دهید؟

# GeoNetToolsMess_13c
source: This tool is designed to work only on Complex Edges
fa_ir: این ابزار فقط روی یال های پیچیده عمل می کند

# GeoNetToolsMess_16e
source: This issue could be caused by the barriers on the network
fa_ir: این مشکل می تواند بعلت موانع شبکه ایجاد شده باشد

# ConstructionToolsError_3
source: is not a polygon layer
fa_ir: یک لایه سطحی نیست

# GeoNetToolsMess_1b
source: geometric network(s).
fa_ir: شبکه (های) هندسی

# CalibrateLn
source: Calibrate Lines
fa_ir: کالیبره کردن خطوط

# SltByJctCountLbl_19
source: Maximum Edge Count
fa_ir: بیشترین تعداد یال

# ConstructionToolsLbl_2
source: Add Laterals
fa_ir: اضافه کردن انشعاب

# GeoNetToolsError_1b
source: not set. No feature classes have source/sink capability.
fa_ir: تنظیم نشد. هیچ کلاس عارضه ای قابلیت سورس/سینک ندارد

source: Proceed?
fa_ir: ادامه؟

# GeoNetToolsMess_11i
source: layer does not connect to any edges. Start editing and re-run this command to remove this junction.
fa_ir: لایه فوق به هیچ یالی متصل نیست. ویرایش را آغاز کرده و این دستور را مجددا اجرا کنید تا نود را حذف کنید

# SltByJctCountLbl_17
source: Select
fa_ir: انتخاب

# OID
source: Object ID:
fa_ir: شناسه شیء:

source: Step:
fa_ir: مرحله:

# AddPtsAndSplitLn
source: Add Point and split line
fa_ir: اضافه نقطه و تکه کردن خط

# GeoNetToolsAlias_1
source: Ground Elevation
fa_ir: ارتفاع زمین

# GeoNetToolsProc_14a
source: Trace Flow
fa_ir: ردیابی جریان

# GeoNetToolsMess_11a
source: unneeded junction in
fa_ir: نود غیر ضروری در

# GeoNetToolsDesc_14b
source: Downstream Trace
fa_ir: ردیابی پایین دست

# GeoNetToolsMess_14c
source: Adding flag to solver
fa_ir: در حال اضافه کردن پرچم به موتور تحلیلگر

# GeoNetToolsError_13b
source: was not able to be moved
fa_ir: قادر به جابجایی نبود

# GeoNetToolsError_10
source: Nothing To Disconnect
fa_ir: چیزی برای قطع اتصال نیست

# GeoNetToolsMess_11j
source: layer do not connect to any edges. Start editing and re-run this command to remove these junctions.
fa_ir: لایه فوق به هیچ یالی متصل نیست. ویرایش را آغاز کرده و این دستور را مجددا اجرا کنید تا این نودها حذف شود

# ConnectAsset
source: Connecting Asset
fa_ir: اتصال تجهیز

# GeoNetToolsProc_6
source: Finding barrier
fa_ir: در حال مانع

# GeoNetToolsProc_16g
source: Saving valves that stopped the trace
fa_ir: ذخیره شیرهایی که ردیابی را متوقف کردند

# GeoNetToolsAlias_17
source: From Elevation
fa_ir: از ارتفاع

source: Feature in
fa_ir: عارضه در

# GeoNetToolsError_19d
source: The Upstream elevation field(
fa_ir: فیلد ارتفاع بالا دست (

# GeometryToolsError_9
source: The selected Segment is not long enough to create the jump
fa_ir: قطعه خط انتخابی برای ایجاد پرش به اندازه کافی طویل نیست

# GeoNetToolsDesc_16a
source: Isolation Trace
fa_ir: ردیابی ایزولاسیون

# GeometryToolsProc_3
source: Rotating points
fa_ir: در حال چرخش نقاط

# SltByJctCountProc_2
source: Selecting junctions for
fa_ir: انتخاب نودها برای

# ConstructionToolsMess_4
source: Layer representing target lines is not a line layer:
fa_ir: لایه تعیین شده هدف یک لایه خطی نیست:

# GeoNetToolsError_18a
source: layer is not part of a geometric network.
fa_ir: بخشی از شبکه هندسی نیست

# NoFlagReturnStatement
source: Error_No flags are found!
fa_ir: خطا_هیچ پرچمی یافت نشد

# GeometryToolsError_1
source: Must have at least one layer in your map.
fa_ir: باید حداقل یک لایه در نقشه باشد.

# CrtPtsToEnd
source: Create additional points on ends
fa_ir: ایجاد نقاط اضافه در دو انتها

source: junction in the
fa_ir: نود در

# ConstructionToolsError_4
source: is not editable or is not a point layer
fa_ir: یک لایه قابل ویرایش یا لایه ی نقطه ای نیست

# GeoNetToolsDesc_11
source: Checking geometric networks connections...
fa_ir: کنترل اتصالات شبکه هندسی...

# GeoNetToolsMess_14b
source: Setting up solver
fa_ir: در حال راه اندازی موتور تحلیلگر

# GeometryToolsMess_4a
source: Checking Layer:
fa_ir: در حال کنترل لایه:

# CanceledReturnStatement
source: Canceled
fa_ir: لغو شده

# GeometryToolsAsk_1
source: Calibrate lines using the digitized direction?
fa_ir: کالیبره کردن خطوط با استفاده از جهت ترسیم؟

# GeometryToolsMess_3
source: Layer Added:
fa_ir: لایه اضافه شده:

source: Query:
fa_ir: پرسش:

# GeoNetToolsError_18d
source: feature class datasource is not set.
fa_ir: منبع داده کلاس عارضه فوق تنظیم نشده است

# AddInCompany
source: Esri., Inc.
fa_ir: Asra, Inc

# SltByJctCountLbl_22
source: Select by Junction
fa_ir: انتخاب با نود

# GeoNetToolsError_20e
source: field.
fa_ir: فیلد

# GeoNetToolsTitle_18a
source: Processing...
fa_ir: در حال پردازش...

# NoFeaturesReturnStatement
source: Error_No features
fa_ir: خطا_ بدون عارضه

# ConstructionToolsMess_3
source: Layer representing target lines was not found. Configuration indicated feature class name:
fa_ir: لایه ی خطی هدف یافت نشد. در فایل تنظیمات، کلاس عارضه زیر تنظیم شده است:

# MergeOprt_4
source: Merge Network Features
fa_ir: ادغام عوارض شبکه

# CrtLnWithPts
source: Create line with points
fa_ir: ایجاد خط با نقاط

# SltByJctCountLbl_14
source: Current Extent
fa_ir: نمای جاری

# NotIntersectReturnStatement
source: Error_The location does not intersect a main, please try again.
fa_ir: خطا_ موقعیت هیچ خط لوله ی اصلی را قطع نمی کند، لطفا مجددا تلاش کنید

# GeoNetToolsTitle_14b
source: Downstream Trace
fa_ir: ردیابی پایین دست

# ConstructionToolsLbl_4
source: Create Dual
fa_ir: ایجاد دوبل

# GeoNetToolsDone_18a
source: Trace Successful
fa_ir: ردیابی موفق

# GeoNetToolsProc_16n
source: Removing directly reachable sources
fa_ir: در حال حذف منابعی که بطور مستقیم در دسترس اند

source: of
fa_ir: از

# GeoNetToolsError_13c
source: Error Selecting Location for Moving connections \r\n
fa_ir: خطا در زمان انتخابی موقعیت حین جابجایی اتصالات

# GeoNetToolsLbl_13a
source: Move Feature Flag
fa_ir: جابجایی پرچم عارضه

# GeoNetToolsError_13a
source: The source and target feature are in different feature classes
fa_ir: عارضه منبع و هدف در کلاس های متمایزی هستند

# GeoNetToolsLbl_16a
source: Origin
fa_ir: منبع

# GeoNetToolsLbl_17a
source: Trace Path
fa_ir: مسیر ردیابی

# GeoNetToolsLbl_18a
source: Summary Isolation Trace
fa_ir: خلاصه ردیابی ایزولاسیون

# GeoNetToolsAlias_7
source: Bottom Elevation
fa_ir: پایین ترین ارتفاع

# DataToolsLbl1
source: Data Tools
fa_ir: ابزارهای داده

# GeoNetToolsError_18f
source: not found in results feature class.
fa_ir: در کلاس عارضه نتایج یافت نشد

# GeometryToolsError_8
source: There was an error creating the jump, this usually occurs when two more intersecting lines are to close. The resulting jump may have an invalid gemeotry, check the sketch(double click to show the vertex's and make sure the geometry looks the same)
fa_ir: خطا در ایجاد پرش، احتمالا بیش از دو خط متقاطع خیلی نزدیکند. پرش ایجاد شده ممکن است هندسه نامعتبر داشته باشد. لطفا هندسه را در اسکچ کنترل نمایید

# GeoNetToolsAlias_14
source: Label
fa_ir: لیبل

# GeometryToolsProc_9
source: Split Lines At Points
fa_ir: تکه کردن خطوط در نقاط

# AddInDesc
source: ArcMap tools for Water, Wastewater and Stormwater
fa_ir: ابزار تخصصی شبکه آب و فاضلاب

# GeoNetToolsMess_13a
source: Please select some valves to proceed
fa_ir: لطفا چند شیر برای ادامه انتخاب کنید

# GeoNetToolsMess_16c
source: feature at an appropriate location on the network or
fa_ir: عارضه در یک موقعیت مناسب در شبکه یا

# MergeOprt_6
source: The display field is used to merge the features, the field contains nulls, try setting the display field to the Object ID field
fa_ir: برای ادغام عوارض فیلد نمایشی استفاده شده است، فیلد مقادیر تهی دارد، سعی کنید فیلدنمایشی را روی شناسه شیء ست کنید

# GeoNetToolsMess_15e
source: feature class was not found in the network you clicked.
fa_ir: در شبکه ای که کلیک کردید یافت نشد

source: Confirm
fa_ir: تایید

# ConstructionToolsLbl_3
source: Create Single
fa_ir: ایجاد منفرد

# GeoNetToolsLbl_11
source: Check Connections
fa_ir: کنترل اتصالات

# DataToolsMess_2
source: Hint: Make some layers selectable before running a trace.
fa_ir: توجه: قبل ردیابی شبکه لایه ها را انتخاب پذیر کنید

# ConstrOptions
source: Construction Options
fa_ir: تنظیمات ساخت

# GeometryToolsProc_1
source: Setting Measure
fa_ir: در حال تنظیم میژر

# GeoNetToolsProc_2
source: Establish Flow
fa_ir: در حال برقرارکردن جهت جریان

# GeoNetToolsProc_3
source: Establish Flow by Digitized Direction
fa_ir: برقراری جهت جریان بوسیله جهت ترسیم

# GeoNetToolsProc_1
source: Setting Flow
fa_ir: در حال تنظیم جریان

# DataToolsMess_1
source: Select some features before running this command.
fa_ir: قبل از اجرا این ابزار چند عارضه در نقشه انتخاب کنید

# GeoNetToolsProc_7
source: Connecting Features
fa_ir: در حال اتصال عوارض

# ConstructionToolsLbl_1
source: Connect Closest
fa_ir: اتصال به نزدیک ترین

# GeoNetToolsProc_5
source: Finding flag
fa_ir: در حال یافتن پرچم

# GeoNetToolsProc_8
source: Connect Selected
fa_ir: اتصال انتخابی

source: Warning
fa_ir: هشدار

# NoFtrFndOnClck
source: A feature was not found at the location you clicked
fa_ir: هیچ عارضه ای در نقطه ای که کلیک کردید یافت نشد

# Test
source: English
fa_ir: انگلیسی

source: is
fa_ir: هست

# GeoNetToolsProc_16i
source: Saving Sources
fa_ir: در حال ذخیره منابع

# GeometryToolsLbl_2
source: Rotate Points
fa_ir: دوران نقاط

# AddInName
source: Water Utility Network Tools
fa_ir: ابزار شبکه آبرسانی

# SlctOneFtr
source: Must have one feature selected before continuing
fa_ir: قبل از ادامه باید یک عارضه انتخاب شده باشد

# GeoNetToolsMess_11b
source: has been removed.
fa_ir: حذف شده است

# ExportXL
source: Export to Excel
fa_ir: خروجی به اکسل

source: Line Length:
fa_ir: طول خط:

# GeoNetToolsProc_16k
source: Tracing to find reachable sources
fa_ir: دریابی برای یافتن منابع در دسترس

# GeoNetToolsDone_20a
source: Accumulation completed for
fa_ir: انباشتگی جریان پایان یافت برای

# SltByJctCountLbl_3
source: Deselect All
fa_ir: پاکن همه انتخاب ها

source: OK
fa_ir: تایید

source: Zoom To
fa_ir: زوم به

# GeoNetToolsTitle_14c
source: Upstream Trace
fa_ir: ردیابی بالا دست

# NbOfPts
source: Number of points
fa_ir: تعداد نقاط

# GeoNetToolsMess_14a
source: Clearing Selection and Graphics
fa_ir: پاک کردن انتخاب و گرافیک ها

# GeoNetToolsMess_1a
source: Flow direction established for
fa_ir: جهت جریان برقرار شد برای

# GeoNetToolsError_16a
source: Error setting the Operable Valves, no operable valves where found\n
fa_ir: خطا در تنظیم شیرهای عملیاتی، هیچ شیر عملیاتی یافت نشد

# GeoNetToolsError_20d
source: does not contain
fa_ir: شامل نمی شود

# GeoNetToolsMess_18a
source: Creating the Summary Layer
fa_ir: در حال ایجاد لایه خلاصه گزارش

# GeoNetToolsTitle_16a
source: Isolation Trace
fa_ir: ردیابی ایزولاسیون

source: Active Layer:
fa_ir: لایه فعال:

# GeometryToolsProc_10
source: Splitting At Selected Points
fa_ir: تکه کردن خط در نقاط انتخابی

# GeoNetToolsProc_15a
source: Finding Connected Assets
fa_ir: در حال یافتن تجهیزات متصل

# GeoNetToolsProc_16c
source: Setting barriers on operables valves
fa_ir: در حال تنظیم کردن موانع روی شیرهای عملیاتی

# GeometryToolsMess_5
source: Any selected lines in this layer will be flipped.
fa_ir: همه خطوط انتخابی در این لایه جهتشان برعکس خواهد شد.

# GeoNetToolsMess_11g
source: layer does not meet the connectivity criteria.
fa_ir: لایه فوق قوانین اتصال را رعایت نمی کند

# ALT_1
source: Add Lateral Tools
fa_ir: ابزار اضافه کردن انشعاب

# GeoNetToolsDesc_15a
source: Find Closest
fa_ir: یافتن نزدیک ترین

# GeoNetToolsError_19b
source: ) was not found
fa_ir: ) یافت نشد

# GeoNetToolsProc_10
source: Diconnecting Features
fa_ir: قطع اتصال عوارض

# GeoNetToolsDesc_19a
source: Finding Path
fa_ir: یافتن مسیر

# SlctSrcAndTarget
source: Please Select a source and then a target line
fa_ir: لطفا یک منبع و سپس یک خط هدف انتخاب کنید

# GeoNetToolsDesc_1
source: Setting Flow Direction
fa_ir: تنظیم جهت جریان

# GeoNetToolsDesc_7
source: Connecting Assets to the geometric network.
fa_ir: اتصال تجهیزات به شبکه هندسی

# GeometryToolsError_7
source: No Editable lines with selected features where found
fa_ir: هیچ خط قابل ویرایشی با عوارض انتخابی یافت نشد

# ConstructionToolsError_6
source: The lateral distance was 0, skipping this feature
fa_ir: فاصله انشعاب 0 بود، نادیده گرفتن این عارضه

# GeoNetToolsMess_13b
source: Please start editing the layers that was clicked
fa_ir: لطفا لایه ای که کلیک کردید را در حالت ویرایش ببرید

# GeoNetToolsMess_7
source: Connecting Features from
fa_ir: اتصال عوارض از

# GeoNetToolsProc_16d
source: Warning, no operable valves were found
fa_ir: هشدار، هیچ شیر عملیاتی یافت نشد

# GeoNetToolsMess_16d
source: change your configuration file to specify a different feature class to use to stop the trace.
fa_ir: فایل تنظیمات را تغییر دهید تا از یک کلاس عارضه دیگر برای توقف ردیابی استفاده کنید

# GeoNetToolsMess_15f
source: Either you pointed to the wrong network or the configuration file needs to be modified to fit your data.
fa_ir: احتمالا یا به شبکه اشتباهی اشاره کردید یا فایل تنظیمات برای سازگاری با داده، نیاز به اصلاح دارد

# GeoNetToolsAlias_5
source: Point Bottom Elevation
fa_ir: پاییترین ارتفاع نقطه

# GeometryToolsProc_4
source: Adding rotation to point
fa_ir: چرخاندن نقاط

# GeometryToolsProc_2
source: Set M's
fa_ir: M's تنظیم

# GeoNetToolsProc_18a
source: mains.
fa_ir: خطوط لوله اصلی

# GeoNetToolsErrorLbl_2
source: Unable to Trace
fa_ir: قادر به ردیابی نیست
